/* eslint-disable */
import React, { Component, PropTypes } from 'react'
import styles from './Completing.scss'

function Protocol(props) {
  return (
    <div className={styles.protocolContent}>
      <p>尊敬的用户：</p>
      <p>非常感谢您选择房装装！</p>
      <p>房装装是专业的家庭微装修服务平台，为广大用户提供各类房屋翻新和轻改造服务，在此特别提醒用户认真阅读本《用户协议》(下称“本协议”)中各个条款，包括免除或限制房装装责任的免责条款及对用户的权利限制条款。用户需认真审阅并选择是否接受本协议（未成年人应在法定监护人陪同下审阅）。用户的使用行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</p>
      <p className={styles.protocolTitle}>一、关于服务条款的确认</p>

      <p>
        房装装（以下简称“本平台”）的各项电子服务的所有权和运作权归广州房装装信息科技有限公司所有。本平台提供的服务将完全按照其发布的服务条款和操作规则严格执行。用户必须完全同意所有服务条款并完成注册程序，才能成为本平台的正式用户。用户确认：本协议条款是处理双方权利义务的当然约定依据，除非违反国家强制性法律，否则始终有效。在下订单的同时，用户也同时承认了其拥有购买该商品或服务的权利能力和行为能力，并且将对在订单中提供的所有信息的真实性负责。
      </p>

      <p className={styles.protocolTitle}>二、关于服务的介绍</p>
      <p>本平台运用自己的操作系统通过国际互联网络为用户提供网络服务。同时，用户必须自行负责解决以下问题：</p>
      <p>1. 自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置。</p>
      <p>2. 自行负担个人上网所支付的与此服务有关的电话费、网络费等相关费用。</p>
      <p>基于本平台所提供的网络服务的重要性，用户应同意：</p>
      <p>1. 保证向本平台提供的任何资料、注册信息的真实性、正确性及完整性，包括但不限于邮箱、联系电话、手机终端通讯软件账户（如微信、微博）等，保证本平台可以通过上述资料内容与用户取得联系。</p>
      <p>2. 当上述资料发生变更时，及时更新用户资料，符合及时、详尽、准确的要求。</p>
      <p>本平台对用户的电子邮件、手机号等隐私资料进行保护，承诺不会在未获得用户许可的情况下擅自将用户的个人资料信息出租或出售给任何第三方，但以下情况除外：</p>
      <p>1. 为完成用户与第三方的交易； </p>
      <p>2. 用户同意让第三方共享资料；</p>
      <p>3. 用户同意公开其个人资料，享受为其提供的商品和服务；</p>
      <p>4. 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
      <p>5. 本平台发现用户违反了本平台服务条款或本平台其它使用规定。</p>
      <p>
      若本平台通过技术检测、人工抽检等手段有合理理由怀疑用户资料信息为错误、不实、失效或不完整，本平台有权暂停或终止用户的账号，并拒绝现在或将来使用本平台网络服务的全部或部分，同时保留追索用户不当得利返还的权利。
      </p>

      <p className={styles.protocolTitle}>三、关于价格和数量</p>
      <p>
      本平台将尽最大努力保证用户所购商品和服务与网站上公布的价格一致，但价目表和声明并不构成要约或承诺。本平台有权在发现其中所显现的商品或服务及订单信息存在明显误解、错误或缺货等的情况下，单方面撤回任何商品信息、服务承诺或订购价格。同时，本平台保留对商品或服务订购的数量的限制权。
      </p>
      <p>
      商品或服务的价格和可获性都将在本平台上指明，这类信息将随时更改且不向用户发出任何通知。商品或服务的价格都包含了增值税。如果发生了意外情况，在确认了您的订单后，由于供应商提价或税率变化引起的价格变动，或是由于本平台的错误信息等原因造成商品或服务的价格变动，您有权临时取消订单，并希望您能及时通过电子邮件或电话通知本平台的客户服务部。
      用户从本平台购买商品或服务后，一旦预约成功，应及时按照预约的时间及方式进行消费，如用户未在预约的时间内进行消费，产生的一切损失将由用户自己承担。
      </p>

      <p className={styles.protocolTitle}>四、关于服务条款的修改</p>
      <p>
      本平台将可能不定期的修改本协议的有关条款，一旦条款及服务内容产生变动，本平台将会在重要页面上提示修改内容。修改后的服务条款自在网页上公布之时起生效，成为本协议的一部分。如果不同意本平台对条款内容所做的修改，用户可以主动取消获得的服务。如果用户继续使用本平台的服务，则视为接受和自愿遵守修改后的服务条款。本平台保留随时修改或中断服务而不需告知用户的权利。本平台行使修改或中断服务的权利，不需对用户或任何第三方负责。
      </p>

      <p className={styles.protocolTitle}>五、关于用户的账户，密码和安全性</p>
      <p>
      用户一旦注册成功，成为本平台的合法用户，将得到一个用户名和密码，用户需维持账户和密码的安全。同时，由于本平台无法对非法或未经用户授权使用用户账号及密码之行为进行甄别，用户需对任何利用该用户专属的账号和密码项下所有行为和事件负全责，本平台不承担任何责任。但用户若发现任何非法使用用户账户或存在安全漏洞的情况，应毫不迟疑地立即通告本平台，共同尽最大努力阻止损害结果发生。
      本平台的账号使用权仅属于初始注册人，禁止赠与、借用、租用、转让或售卖。如果本平台发现使用者并非账号初始注册人，有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任。本平台禁止用户私下有偿或无偿转让账号，以免因账号问题产生纠纷，用户应当自行承担因违反此要求而遭致的任何损失，同时本平台保留追究上述行为人法律责任的权利。
      </p>
      <p>
      如发生利用计算机程序等其他技术手段进行恶意注册、邀请、参与的情形，本平台有权在不事先通知用户的情况下单方面中断或终止向用户提供服务而无需另行通知用户。
      </p>

      <p className={styles.protocolTitle}>六、关于是否提供担保</p>
      <p>
        用户个人对网络服务的使用承担风险。本平台对此不作任何类型的担保，不论是明确的或隐含的，但是不对商业性的隐含担保、特定目的和不违反规定的适当担保作限制。本平台不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性和出错情况发生均不作担保。本平台对在本平台上得到的任何商品或服务或交易进程，不作任何担保。
      </p>
      <p className={styles.protocolTitle}>七、关于有限责任</p>
      <p>
        本平台对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害可能来自：不正当使用网络服务、在网上购买商品或服务，在网上进行交易、非法使用网络服务或用户传送的信息有所错漏等。上述这些行为都有可能会导致本平台的形象受损，所以本平台事先声明出现这种损害的可能性和有限责任。
      </p>

      <p className={styles.protocolTitle}>八、关于对用户信息的存储和限制</p>
      <p>
        本平台不对用户所发布信息的删除或储存失败负责。本平台有判定用户的行为是否符合本平台服务条款的要求和精神的保留权利，如果用户违背了服务条款的规定，本平台有权随时中断对其提供网络服务。
      </p>

      <p className={styles.protocolTitle}>九、关于用户保障</p>
      <p>
      本平台同意并承诺将保障和维护本平台全体用户的合法利益。
      </p>

      <p className={styles.protocolTitle}>十、关于结束服务</p>
      <p>用户或本平台可随时根据实际情况中断一项或多项服务。用户对后来的条款修改有异议或对本平台的服务不满，可以行使如下权利：
      </p>
      <p>
      1. 主动暂停或停止使用本平台的相关服务。
      </p>
      <p>
      2. 通告本平台暂停或停止对该用户提供相关服务。
      结束用户服务后，用户使用网络服务的权利马上中止。从此时起，用户没有权利要求本平台、本平台也没有义务传送任何未处理的信息或提供未完成的服务给用户或任何第三方。
      </p>

      <p className={styles.protocolTitle}>十一、关于通告和通知</p>
      <p>
      本平台向注册用户发送的通知或通告时，用户均同意本平台以其登记的电子邮件、手机短信、手机终端通讯软件账户（如微信、微博等）等电子方式或常规的信件传递方式进行发送，本条所指的通知或通告于公告或发送之日视为已送达用户。因信息传输、用户未及时变更登记的联系方式等原因导致用户未收到该等通知的，本平台不承担责任由此产生的任何责任。如用户不再需要此项服务，可以自行通过以下方式主动取消服务短信（1）直接回复短信“TD”退订短信（2）拨打平台客服电话“400-993-9308”退订短信。
      </p>

      <p className={styles.protocolTitle}>十二、关于广告策划</p>
      <p>
      用户在其发表的信息中加入宣传资料或参与广告策划，在本平台的免费服务窗口上展示其商品，任何类似此类的促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只在用户和相应的广告商之间发生。本平台不承担任何责任，本平台不为这类广告销售行为和结构负任何责任。
      </p>

      <p className={styles.protocolTitle}>十三、关于网络服务内容的所有权</p>
      <p>
      本平台定义的网络服务内容包括：文字、软件、声音、图片、录像、图表，以及广告和电子邮件中的全部内容以及为用户提供的其他信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在取得本平台和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容或创造与内容有关的衍生商品。本平台所有的文章版权归原文作者和本平台共同所有，任何第三方需要转载本平台的文章，必须征得原文作者或本平台的授权。
      </p>
      <p>
      任何用户接受本协议，即表明该用户主动将其在本平台上发表的各类信息的著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利）无偿独家转让给本平台的运营商所有，同时表明该用户许可本平台有权利就任何其他主体的侵权行为独立提起诉讼，并获得全部赔偿。
      本协议已经构成《著作权法》第二十五条所规定的书面协议，其效力基于用户在本平台发布的任何受《著作权法》保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。
      </p>
      <p>
      用户确认本协议即表示明确了解并同意上述条款，不将已发表于本平台的信息再以任何形式发布或授权其它网站（及媒体）使用。同时，本平台享有删除平台内各类不符合规定的评价或评论信息而无需通知用户的权利。
      </p>

      <p className={styles.protocolTitle}>十四、关于责任限制</p>
      <p>
      如因各种不可抗力或其他本平台无法控制的原因使本平台的系统出现崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，本平台不承担任何责任。但本平台会尽可能合理地协助处理善后事宜，并努力使用户免受损失。除了本平台的使用条件中规定的其它限制和除外情况之外，在中国法律法规所允许的限度内，对于因网上交易而引起的或与之有关的任何直接的、间接的、特殊的、附带的、后果性的或惩罚性的损害，或任何其它性质的损害，本平台及本平台的董事、管理人员、雇员、代理或其它代表等在任何情况下均不承担责任。本平台的全部责任，不论是合同、保证、侵权（包括过失）项下的还是其它的责任，均不超过该用户所购买的与该索赔有关的商品或服务的价值总额。
      </p>

      <p className={styles.protocolTitle}>十五、关于法律管辖和适用</p>
      <p>
      本协议的订立、执行、解释和争议的解决均应适用中国法律法规。
      如发生本平台服务条款与中国法律法规相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对用户产生法律效力和影响。
      </p>
      <p>
      本协议的相关规定是可分割的，即如果本协议的部分条款规定被裁定为无效或不可执行，该规定可被删除，但其余条款应按原约定条款或规定执行。如果本平台和用户双方就本协议内容或其执行发生任何争议，双方应友好协商解决；协商不成时，任何一方均可向广州市仲裁委会议申请仲裁或向广州市人民法院提起诉讼。
      </p>
    </div>
  )
}

Protocol.propTypes = {

}

export default Protocol

