const data = [{
  question: '你们用的材料环保吗，翻新后我能马上搬进去住吗？',
  answer: '房装装使用的材料全部都是国家认证的品牌，绝对环保。翻新完成后除油漆翻新外需要空出2-3天时间才能入住，其他翻新项目是可以立即入住的。',
}, {
  question: '施工完成后费用怎么支付？',
  answer: '可以通过现金、转账、微信、支付宝等相关快捷支付方式',
}, {
  question: '下单后还会有其他费用产生吗？不会像其他装修公司一样有增加费用吧？',
  answer: '只要下单后我们的系统会默认并且订单已经具备合同法的要求，我们在施工过程中不会有任何增加的费用，除业主主动提出需要增加其他服务的项目',
}, {
  question: '施工过程中产生的垃圾要业主自己处理吗？',
  answer: '在施工的过程中包括完工后的垃圾都是由我们师傅自己清理并且带走的。',
}, {
  question: '施工改造过程中如果工人损坏了物品怎么办？',
  answer: '我们的师傅都是经过严格的培训才能上岗的，在施工前期师傅会对相应的物体做好保护，避免发生损坏业主的物品。如果由于师傅不小心损坏了我们公司也会根据损坏的物品对业主进行赔偿。',
}, {
  question: '施工完成后我不满意怎么办？',
  answer: '翻新后不满意施工效果，可直接拨打我们的客服电话，我们会在24小时内安排专业的项目经理上门检测及安排师傅上门再次服务确保施工质量。',
}, {
  question: '施工后的工程保修期是多久？',
  answer: '一般墙面翻新保修期为三年、水电五年、防水五年，其他翻新保修期不低于三年。',
}]

export default data
